{
  "name": "Coordinates",
  "description": "Secure context This feature is available only in secure contexts (HTTPS), in some or all supporting browsers. The Coordinates interface represents the position and altitude of the device on Earth, as well as the accuracy with which these properties are calculated.",
  "members": [
    {
      "name": "Coordinates.latitude",
      "link": "/en-US/docs/Web/API/Coordinates/latitude",
      "description": "Returns a double representing the position\u0027s latitude in decimal degrees."
    },
    {
      "name": "Coordinates.longitude",
      "link": "/en-US/docs/Web/API/Coordinates/longitude",
      "description": "Returns a double representing the position\u0027s longitude in decimal degrees."
    },
    {
      "name": "Coordinates.altitude",
      "link": "/en-US/docs/Web/API/Coordinates/altitude",
      "description": "Returns a double representing the position\u0027s altitude in meters, relative to sea level. This value can be null if the implementation cannot provide the data."
    },
    {
      "name": "Coordinates.accuracy",
      "link": "/en-US/docs/Web/API/Coordinates/accuracy",
      "description": "Returns a double representing the accuracy of the latitude and longitude properties, expressed in meters."
    },
    {
      "name": "Coordinates.altitudeAccuracy",
      "link": "/en-US/docs/Web/API/Coordinates/altitudeAccuracy",
      "description": "Returns a double representing the accuracy of the altitude expressed in meters. This value can be null."
    },
    {
      "name": "Coordinates.heading",
      "link": "/en-US/docs/Web/API/Coordinates/heading",
      "description": "Returns a double representing the direction in which the device is traveling. This value, specified in degrees, indicates how far off from heading true north the device is. 0 degrees represents true north, and the direction is determined clockwise (which means that east is 90 degrees and west is 270 degrees). If speed is 0, heading is NaN. If the device is unable to provide heading information, this value is null."
    },
    {
      "name": "Coordinates.speed",
      "link": "/en-US/docs/Web/API/Coordinates/speed",
      "description": "Returns a double representing the velocity of the device in meters per second. This value can be null."
    }
  ]
}