{
  "name": "HTMLButtonElement",
  "description": "The HTMLButtonElement interface provides properties and methods (beyond the \u003cbutton\u003e object interface it also has available to them by inheritance) for manipulating the layout and presentation of button elements.",
  "members": [
    {
      "name": "HTMLButtonElement.accessKey",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/accessKey",
      "description": "Is a DOMString indicating the single-character keyboard key to give access to the button."
    },
    {
      "name": "HTMLButtonElement.autofocus",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/autofocus",
      "description": "Is a Boolean indicating whether or not the control should have input focus when the page loads, unless the user overrides it, for example by typing in a different control. Only one form-associated element in a document can have this attribute specified."
    },
    {
      "name": "HTMLButtonElement.disabled",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/disabled",
      "description": "Is a Boolean indicating whether or not the control is disabled, meaning that it does not accept any clicks."
    },
    {
      "name": "HTMLButtonElement.form",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/form",
      "description": "Is a HTMLFormElement reflecting the form that this button is associated with. If the button is a descendant of a form element, then this attribute is the ID of that form element. If the button is not a descendant of a form element, then the attribute can be the ID of any form element in the same document it is related to, or the null value if none matches."
    },
    {
      "name": "HTMLButtonElement.formAction",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/formAction",
      "description": "Is a DOMString reflecting the URI of a resource that processes information submitted by the button. If specified, this attribute overrides the action attribute of the \u003cform\u003e element that owns this element."
    },
    {
      "name": "HTMLButtonElement.formEnctype",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/formEnctype",
      "description": "Is a DOMString reflecting the type of content that is used to submit the form to the server. If specified, this attribute overrides the enctype attribute of the \u003cform\u003e element that owns this element."
    },
    {
      "name": "HTMLButtonElement.formMethod",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/formMethod",
      "description": "Is a DOMString reflecting the HTTP method that the browser uses to submit the form. If specified, this attribute overrides the method attribute of the \u003cform\u003e element that owns this element."
    },
    {
      "name": "HTMLButtonElement.formNoValidate",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/formNoValidate",
      "description": "Is a Boolean indicating that the form is not to be validated when it is submitted. If specified, this attribute overrides the novalidate attribute of the \u003cform\u003e element that owns this element."
    },
    {
      "name": "HTMLButtonElement.formTarget",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/formTarget",
      "description": "Is a DOMString reflecting a name or keyword indicating where to display the response that is received after submitting the form. If specified, this attribute overrides the target attribute of the \u003cform\u003e element that owns this element."
    },
    {
      "name": "HTMLButtonElement.labels",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/labels",
      "description": "Is a NodeList that represents a list of \u003clabel\u003e elements that are labels for this button."
    },
    {
      "name": "HTMLButtonElement.menu",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/menu",
      "description": "Is a HTMLMenuElement representing the menu element to be displayed if the button is clicked and is of type\u003d\"menu\"."
    },
    {
      "name": "HTMLButtonElement.name",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/name",
      "description": "Is a DOMString representing the name of the object when submitted with a form. HTML5 If specified, it must not be the empty string."
    },
    {
      "name": "HTMLButtonElement.tabIndex",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/tabIndex",
      "description": "Is a long that represents this element\u0027s position in the tabbing order."
    },
    {
      "name": "HTMLButtonElement.type",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/type",
      "description": "Is a DOMString indicating the behavior of the button. This is an enumerated attribute with the following possible values: \"submit\": The button submits the form. This is the default value if the attribute is not specified, HTML5 or if it is dynamically changed to an empty or invalid value. \"reset\": The button resets the form. \"button\": The button does nothing. \"menu\": The button displays a menu."
    },
    {
      "name": "HTMLButtonElement.validationMessage",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/validationMessage",
      "description": "Is a DOMString representing the localized message that describes the validation constraints that the control does not satisfy (if any). This attribute is the empty string if the control is not a candidate for constraint validation (willValidate is false), or it satisfies its constraints."
    },
    {
      "name": "HTMLButtonElement.validity",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/validity",
      "description": "Is a ValidityState representing the validity states that this button is in."
    },
    {
      "name": "HTMLButtonElement.value",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/value",
      "description": "Is a DOMString representing the current form control value of the button."
    },
    {
      "name": "HTMLButtonElement.willValidate",
      "link": "/en-US/docs/Web/API/HTMLButtonElement/willValidate",
      "description": "Is a Boolean indicating whether the button is a candidate for constraint validation. It is false if any conditions bar it from constraint validation."
    }
  ]
}