{
  "name": "HTMLFieldSetElement",
  "description": "The HTMLFieldSetElement interface has special properties and methods (beyond the regular HTMLElement interface it also has available to it by inheritance) for manipulating the layout and presentation of field-set elements.",
  "members": [
    {
      "name": "HTMLFieldSetElement.disabled",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/disabled",
      "description": "A Boolean reflecting the disabled HTML attribute, indicating whether the user can interact with the control."
    },
    {
      "name": "HTMLFieldSetElement.elements",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/elements",
      "description": "The elements belonging to this field set. The type of this property depends on the version of the spec that is implemented by the browser."
    },
    {
      "name": "HTMLFieldSetElement.form",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/form",
      "description": "An HTMLFormControlsCollection or HTMLCollection referencing the containing form element, if this element is in a form. If the button is not a descendant of a form element, then the attribute can be the ID of any form element in the same document it is related to, or the null value if none matches."
    },
    {
      "name": "HTMLFieldSetElement.name",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/name",
      "description": "A DOMString reflecting the name HTML attribute, containing the name of the field set, used for submitting the form."
    },
    {
      "name": "HTMLFieldSetElement.type",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/type",
      "description": "The DOMString \"fieldset\"."
    },
    {
      "name": "HTMLFieldSetElement.validationMessage",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/validationMessage",
      "description": "A DOMString representing a localized message that describes the validation constraints that the element does not satisfy (if any). This is the empty string if the element is not a candidate for constraint validation (willValidate is false), or it satisfies its constraints."
    },
    {
      "name": "HTMLFieldSetElement.validity",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/validity",
      "description": "A ValidityState representing the validity states that this element is in."
    },
    {
      "name": "HTMLFieldSetElement.willValidate",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/willValidate",
      "description": "A Boolean false, because \u003cfieldset\u003e objects are never candidates for constraint validation."
    },
    {
      "name": "HTMLFieldSetElement.checkValidity()",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/checkValidity",
      "description": "Always returns true because \u003cfieldset\u003e objects are never candidates for constraint validation."
    },
    {
      "name": "HTMLFieldSetElement.setCustomValidity()",
      "link": "/en-US/docs/Web/API/HTMLFieldSetElement/setCustomValidity",
      "description": "Sets a custom validity message for the field set. If this message is not the empty string, then the field set is suffering from a custom validity error, and does not validate."
    }
  ]
}