{
  "name": "IDBFactorySync",
  "description": "",
  "members": [
    {
      "name": "IDBDatabaseSync",
      "link": "/en/IndexedDB/IDBDatabaseSync",
      "description": "An object to access the open database.",
      "parameters": [
        {
          "name": "name",
          "description": "The name of a new object store."
        },
        {
          "name": "keypath",
          "description": "The key path used by the new object store. If a null path is specified, then the object store does not have a key path, and uses out-of-line keys."
        },
        {
          "name": "autoIncrement",
          "description": "If true, the object store uses a key generator; if false, it does not use one."
        },
        {
          "name": "IDBObjectStoreSync",
          "description": "An object to access the newly created object store."
        },
        {
          "name": "CONSTRAINT_ERR",
          "description": "If an object store with the same name (based on case-sensitive comparison) already exists in the connected database."
        },
        {
          "name": "name",
          "description": "The name of the object store to open."
        },
        {
          "name": "mode",
          "description": "The mode that is used to access the object store."
        },
        {
          "name": "IDBObjectStoreSync",
          "description": "An object to access the opened object store."
        },
        {
          "name": "NOT_FOUND_ERR",
          "description": "If an object store with the given name (based on case-sensitive comparison) already exists in the connected database."
        },
        {
          "name": "storeName",
          "description": "The name of an existing object store to remove."
        },
        {
          "name": "NOT_FOUND_ERR",
          "description": ""
        },
        {
          "name": "version",
          "description": "The version to store in the database."
        },
        {
          "name": "storeNames",
          "description": "The names of object stores and indexes in the scope of the new transaction."
        },
        {
          "name": "timeout",
          "description": "The interval that this operation is allowed to take to acquire locks on all the objects stores and indexes identified in storeNames."
        },
        {
          "name": "IDBTransactionSync",
          "description": "An object to access the newly created transaction."
        },
        {
          "name": "TIMEOUT_ERR",
          "description": "If reserving all the database objects identified in storeNames takes longer than the timeout interval."
        }
      ]
    },
    {
      "name": "NON_TRANSIENT_ERR",
      "link": "/en/IndexedDB/IDBDatabaseException#NON_TRANSIENT_ERR",
      "description": "If the name parameter is not valid. A valid name is any string including the empty string."
    },
    {
      "name": "UNKNOWN_ERR",
      "link": "/en/IndexedDB/IDBDatabaseException#UNKNOWN_ERR",
      "description": "If an error occurs while the database is being opened."
    }
  ]
}