{
  "name": "IDBOpenDBRequest",
  "description": "",
  "members": [
    {
      "name": "IDBOpenDBRequest.onblocked",
      "link": "/en-US/docs/Web/API/IDBOpenDBRequest/onblocked",
      "description": "The event handler for the blocked event. This event is triggered when the upgradeneeded event should be triggered because of a version change but the database is still in use (i.e. not closed) somewhere, even after the versionchange event was sent."
    },
    {
      "name": "IDBOpenDBRequest.onupgradeneeded",
      "link": "/en-US/docs/Web/API/IDBOpenDBRequest/onupgradeneeded",
      "description": "The event handler for the upgradeneeded event, fired when a database of a bigger version number than the existing stored database is loaded."
    },
    {
      "name": "IDBRequest",
      "link": "/en-US/docs/Web/API/IDBRequest",
      "description": "",
      "parameters": [
        {
          "name": "IDBRequest.error Read only",
          "description": "Returns an error in the event of an unsuccessful request, indicating what went wrong."
        },
        {
          "name": "IDBRequest.result Read only",
          "description": "Returns the result of the request. If the the request failed and the result is not available, an InvalidStateError exception is thrown."
        },
        {
          "name": "IDBRequest.source Read only",
          "description": "The source of the request, such as an IDBIndex or an IDBObjectStore. If no source exists (such as when calling IDBFactory.open), it returns null."
        },
        {
          "name": "IDBRequest.readyState Read only",
          "description": "The state of the request. Every request starts in the pending state. The state changes to done when the request completes successfully or when an error occurs."
        },
        {
          "name": "IDBRequest.transaction Read only",
          "description": "The transaction for the request. This property can be null for certain requests, for example those returned from IDBFactory.open unless an upgrade is needed. (You\u0027re just connecting to a database, so there is no transaction to return)."
        },
        {
          "name": "IDBRequest.onerror",
          "description": "The event handler for the error event."
        },
        {
          "name": "IDBRequest.onsuccess",
          "description": "The event handler for the success event."
        }
      ]
    }
  ]
}