{
  "name": "MediaStreamTrack",
  "description": "The MediaStreamTrack interface represents a single media track within a stream; typically, these are audio or video tracks, but other track types may exist as well.",
  "members": [
    {
      "name": "MediaStreamTrack.enabled",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/enabled",
      "description": "A Boolean value with a value of true if the track is enabled, that is allowed to render the media source stream; or false if it is disabled, that is not rendering the media source stream but silence and blackness. If the track has been disconnected, this value can be changed but has no more effect."
    },
    {
      "name": "MediaStreamTrack.id",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/id",
      "description": "Returns a DOMString containing a unique identifier (GUID) for the track; it is generated by the browser."
    },
    {
      "name": "MediaStreamTrack.kind",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/kind",
      "description": "Returns a DOMString set to \"audio\" if the track is an audio track and to \"video\", if it is a video track. It doesn\u0027t change if the track is deassociated from its source."
    },
    {
      "name": "MediaStreamTrack.label",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/label",
      "description": "Returns a DOMString containing a user agent-assigned label that identifies the track source, as in \"internal microphone\". The string may be left empty and is empty as long as no source has been connected. When the track is deassociated from its source, the label is not changed."
    },
    {
      "name": "MediaStreamTrack.muted",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/muted",
      "description": "Returns a Boolean value indicating whether the track is muted."
    },
    {
      "name": "MediaStreamTrack.readonly",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/readonly",
      "description": "Returns a Boolean value with a value of true if the track is readonly (such a video file source or a camera that settings can\u0027t be modified),false otherwise."
    },
    {
      "name": "MediaStreamTrack.readyState",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/readyState",
      "description": "Returns an enumerated value giving the status of the track. This will be one of the following values: \"live\" which indicates that an input is connected and does its best-effort in providing real-time data. In that case, the output of data can be switched on or off using the MediaStreamTrack.enabled attribute. \"ended\" which indicates that the input is not giving any more data and will never provide new data."
    },
    {
      "name": "MediaStreamTrack.remote",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/remote",
      "description": "Returns a Boolean with a value of true if the track is sourced by a RTCPeerConnection, false otherwise."
    },
    {
      "name": "MediaStreamTrack.onstarted",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/onstarted",
      "description": "Is a EventHandler containing the action to perform when an started event is fired on the object, that is when a new MediaStreamTrack object is added."
    },
    {
      "name": "MediaStreamTrack.onmute",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/onmute",
      "description": "Is a EventHandler containing the action to perform when an mute event is fired on the object, that is when the streaming is terminating."
    },
    {
      "name": "MediaStreamTrack.onunmute",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/onunmute",
      "description": "Is a EventHandler containing the action to perform when an unmute event is fired on the object, that is when a  MediaStreamTrack object is removed from it."
    },
    {
      "name": "MediaStreamTrack.onoverconstrained",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/onoverconstrained",
      "description": "Is a EventHandler containing the action to perform when an overconstrained event is fired on the object, that is when a  MediaStreamTrack object is removed from it."
    },
    {
      "name": "MediaStreamTrack.onended",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/onended",
      "description": "Is a EventHandler containing the action to perform when an ended event is fired on the object, that is when a  MediaStreamTrack object is removed from it."
    },
    {
      "name": "applyConstraints()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/applyConstraints",
      "description": "Lets the application specify the ideal and/or ranges of acceptable values for any number of the available constrainable properties of the MediaStreamTrack.",
      "parameters": [
        {
          "name": "constraints Optional",
          "description": "A MediaTrackConstraints object listing the constraints to apply to the track\u0027s constrainable properties; any existing constraints are replaced with the new values specified, and any constrainable properties not included are restored to their default constraints. If this parameter is omitted, all currently set custom constraints are cleared."
        }
      ]
    },
    {
      "name": "clone()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/clone",
      "description": "Returns a duplicate of the MediaStreamTrack."
    },
    {
      "name": "getCapabilities()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/getCapabilities",
      "description": "Returns the a list of constrainable properties available for the MediaStreamTrack."
    },
    {
      "name": "getConstraints()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/getConstraints",
      "description": "Returns a MediaTrackConstraints object containing the currently set constraints for the track; the returned value matches the constraints last set using applyConstraints()."
    },
    {
      "name": "getSettings()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/getSettings",
      "description": "Returns a MediaTrackSettings object containing the current values of each of the MediaStreamTrack\u0027s constrainable properties."
    },
    {
      "name": "stop()",
      "link": "/en-US/docs/Web/API/MediaStreamTrack/stop",
      "description": "Stops playing the source associated to the track, both the source and the track are deassociated. The track state is set to ended."
    }
  ]
}