{
  "name": "Notification",
  "description": "",
  "members": [
    {
      "name": "Notification()",
      "link": "/en-US/docs/Web/API/Notification/Notification",
      "description": "Creates a new instance of the Notification object.",
      "parameters": [
        {
          "name": "title",
          "description": "Defines a title for the notification, which will be shown at the top of the notification window when it is fired."
        },
        {
          "name": "options Optional",
          "description": "An options object containing any custom settings that you want to apply to the notification. The possible options are: dir: The direction in which to display the notification. It defaults to auto, which just adopts the browser\u0027s language setting behavior, but you can override that behaviour by setting values of ltr and rtl (although most browsers seem to ignore these settings.) lang: The notification\u0027s language, as specified using a DOMString representing a BCP 47 language tag. See the Sitepoint ISO 2 letter language codes page for a simple reference. badge: A USVString containing the URL of the image used to represent the notification when there is not enough space to display the notification itself. body: A DOMString representing the body text of the notification, which will be displayed below the title. tag: A DOMString representing an identifying tag for the notification. icon: A USVString containing the URL of an icon to be displayed in the notification. image: a USVString containing the URL of an image to be displayed in the notification. data: Arbitrary data that you want associated with the notification. This can be of any data type. vibrate: A vibration pattern for the device\u0027s vibration hardware to emit when the notification fires. renotify: A Boolean specifying whether the user should be notified after a new notification replaces an old one. The default is false, which means they won\u0027t be notified. requireInteraction: Indicates that a notification should remain active until the user clicks or dismisses it, rather than closing automatically. The default value is false. actions: An array of NotificationActions representing the actions available to the user when the notification is presented. These are options the user can choose among in order to act on the action within the context of the notification itself. The action\u0027s name is sent to the service worker notification handler to let it know the action was selected by the user. The following options are listed in the most up-to-date spec, but are not supported in any browsers yet. It is advisable to keep checking back regularly to see if the status of these has updated, and let us know if you find any out of date information. silent: A Boolean specifying whether the notification should be silent, i.e. no sounds or vibrations should be issued, regardless of the device settings. The default is false, which means it won\u0027t be silent. sound: A USVString containing the URL of an audio file to be played when the notification fires. noscreen: A Boolean specifying whether the notification firing should enable the device\u0027s screen or not. The default is false, which means it will enable the screen. sticky: A Boolean specifying whether the notification should be \u0027sticky\u0027, i.e. not easily clearable by the user. The default is false, which means it won\u0027t be sticky. "
        }
      ]
    },
    {
      "name": "Notification.permission",
      "link": "/en-US/docs/Web/API/Notification/permission",
      "description": "A string representing the current permission to display notifications. Possible values are: denied — The user refuses to have notifications displayed. granted — The user accepts having notifications displayed. default — The user choice is unknown and therefore the browser will act as if the value were denied."
    },
    {
      "name": "Notification.actions",
      "link": "/en-US/docs/Web/API/Notification/actions",
      "description": "The actions array of the notification as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.badge",
      "link": "/en-US/docs/Web/API/Notification/badge",
      "description": "The URL of the image used to represent the notification when there is not enough space to display the notification itself."
    },
    {
      "name": "Notification.body",
      "link": "/en-US/docs/Web/API/Notification/body",
      "description": "The body string of the notification as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.data",
      "link": "/en-US/docs/Web/API/Notification/data",
      "description": "Returns a structured clone of the notification’s data."
    },
    {
      "name": "Notification.dir",
      "link": "/en-US/docs/Web/API/Notification/dir",
      "description": "The text direction of the notification as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.lang",
      "link": "/en-US/docs/Web/API/Notification/lang",
      "description": "The language code of the notification as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.tag",
      "link": "/en-US/docs/Web/API/Notification/tag",
      "description": "The ID of the notification (if any) as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.icon",
      "link": "/en-US/docs/Web/API/Notification/icon",
      "description": "The URL of the image used as an icon of the notification as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.image",
      "link": "/en-US/docs/Web/API/Notification/image",
      "description": "The  URL of an image to be displayed as part of the notification, as specified in the options parameter of the constructor."
    },
    {
      "name": "Notification.requireInteraction",
      "link": "/en-US/docs/Web/API/Notification/requireInteraction",
      "description": "A Boolean indicating that a notification should remain active until the user clicks or dismisses it, rather than closing automatically."
    },
    {
      "name": "Notification.silent",
      "link": "/en-US/docs/Web/API/Notification/silent",
      "description": "Specifies whether the notification should be silent, i.e. no sounds or vibrations should be issued, regardless of the device settings."
    },
    {
      "name": "Notification.timestamp",
      "link": "/en-US/docs/Web/API/Notification/timestamp",
      "description": "Specifies the time at which a notification is created or applicable (past, present, or future)."
    },
    {
      "name": "Notification.title",
      "link": "/en-US/docs/Web/API/Notification/title",
      "description": "The title of the notification as specified in the first parameter of the constructor."
    },
    {
      "name": "Notification.vibrate",
      "link": "/en-US/docs/Web/API/Notification/vibrate",
      "description": "Specifies a vibration pattern for devices with vibration hardware to emit."
    },
    {
      "name": "Notification.noscreen",
      "link": "/en-US/docs/Web/API/Notification/noscreen",
      "description": "Specifies whether the notification firing should enable the device\u0027s screen or not."
    },
    {
      "name": "Notification.renotify",
      "link": "/en-US/docs/Web/API/Notification/renotify",
      "description": "Specifies whether the user should be notified after a new notification replaces an old one."
    },
    {
      "name": "Notification.sound",
      "link": "/en-US/docs/Web/API/Notification/sound",
      "description": "Specifies a sound resource to play when the notification fires, in place of the default system notification sound."
    },
    {
      "name": "Notification.sticky",
      "link": "/en-US/docs/Web/API/Notification/sticky",
      "description": "Specifies whether the notification should be \u0027sticky\u0027, i.e. not easily clearable by the user."
    },
    {
      "name": "Notification.onclick",
      "link": "/en-US/docs/Web/API/Notification/onclick",
      "description": "A handler for the click event. It is triggered each time the user clicks on the notification."
    },
    {
      "name": "Notification.onerror",
      "link": "/en-US/docs/Web/API/Notification/onerror",
      "description": "A handler for the error event. It is triggered each time the notification encounters an error."
    },
    {
      "name": "Notification.onclose",
      "link": "/en-US/docs/Web/API/Notification/onclose",
      "description": "A handler for the close event. It is triggered when the user closes the notification."
    },
    {
      "name": "Notification.onshow",
      "link": "/en-US/docs/Web/API/Notification/onshow",
      "description": "A handler for the show event. It is triggered when the notification is displayed."
    },
    {
      "name": "Notification.requestPermission()",
      "link": "/en-US/docs/Web/API/Notification/requestPermission",
      "description": "Requests permission from the user to display notifications.",
      "parameters": [
        {
          "name": "callback Optional Deprecated since Gecko 46",
          "description": "An optional callback function that is called with the permission value. Deprecated in favor of the promise return value."
        }
      ]
    },
    {
      "name": "Notification.close()",
      "link": "/en-US/docs/Web/API/Notification/close",
      "description": "Programmatically closes a notification."
    }
  ]
}