{
  "name": "PasswordCredential",
  "description": "",
  "members": [
    {
      "name": "PasswordCredential()",
      "link": "/en-US/docs/Web/API/PasswordCredential/PasswordCredential",
      "description": "Creates a new PasswordCredential object.",
      "parameters": [
        {
          "name": "passwordCredentialData ",
          "description": "A PasswordCredentialData dictionary containing the following fields: iconURL: (Optional) the URL of a user\u0027s avatar image. id: The ID of the user signing in. name: (Optional) The name of the user signing in. password: The password of the user signing in."
        },
        {
          "name": "htmlFormElement",
          "description": "A reference to an HTMLFormElement with appropriate input fields. The form should, at the very least, contain an id and password. It could also require a CSRF token."
        }
      ]
    },
    {
      "name": "PasswordCredential.additionalData",
      "link": "/en-US/docs/Web/API/PasswordCredential/additionalData",
      "description": "One of a FormData instance, a URLSearchParams instance, or null. The data in the objects will be added to the request body and sent to the remote endpoint with the credentials."
    },
    {
      "name": "PasswordCredential.idName",
      "link": "/en-US/docs/Web/API/PasswordCredential/idName",
      "description": "A USVString representing the name that will be used for the ID field when submitting the current object to a remote endpoint via fetch. This property defaults to \u0027username\u0027, but may be overridden to match whatever the backend service expects."
    },
    {
      "name": "PasswordCredential.passwordName",
      "link": "/en-US/docs/Web/API/PasswordCredential/passwordName",
      "description": "A USVString representing the name that will be used for the password field when submitting the current object to a remote endpoint via fetch. This property defaults to \u0027password\u0027, but may be overridden to match whatever the backend service expects."
    }
  ]
}