{
  "name": "SVGCircleElement",
  "description": "The SVGCircleElement interface is an interface for the \u003ccircle\u003e element. The circle element is defined by the cx and cy attributes that denote the coordinates of the centre of the circle. It also has a radius attribute r that denotes the radius of the circle. The radius value must be positive to allow the successful rendering of the element.",
  "members": [
    {
      "name": "SVGCircleElement.cx",
      "link": "/en-US/docs/Web/API/SVGCircleElement/cx",
      "description": "This property defines the x-coordinate of the center of the circle element. It is denoted by the cx attribute of the \u003ccircle\u003e element. If unspecified, the value of this attribute is assumed to be 0. It can be animated by SVG\u0027s animation elements.",
      "parameters": [
        {
          "name": "\u003ccoordinate\u003e",
          "description": "A \u003ccoordinate\u003e is a length in the user coordinate system that is the given distance from the origin of the user coordinate system along the relevant axis (the x-axis for X coordinates, the y-axis for Y coordinates). Its syntax is the same as that for \u003clength\u003e. Within the SVG DOM, a \u003ccoordinate\u003e is represented as an SVGLength or an SVGAnimatedLength."
        }
      ]
    },
    {
      "name": "SVGCircleElement.cy",
      "link": "/en-US/docs/Web/API/SVGCircleElement/cy",
      "description": "This property defines the y-coordinate of the center of the circle element. It is denoted by the cy attribute of the \u003ccircle\u003e element. If unspecified, the value of this attribute is assumed to be 0. It can be animated by SVG\u0027s animation elements."
    },
    {
      "name": "SVGCircleElement.r",
      "link": "/en-US/docs/Web/API/SVGCircleElement/r",
      "description": "This property defines the radius of the circle element. It is denoted by the r of the \u003ccircle\u003e element. A negative value gives an error, while 0 disables the rendering of the element. It can be animated by SVG\u0027s animation elements."
    }
  ]
}