{
  "name": "TextTrack",
  "description": "The TextTrack interface—part of the API for handling WebVTT (text tracks on media presentations)—describes and controls the text track associated with a particular \u003ctrack\u003e element. Properties This interface also inherits properties from EventTarget.",
  "members": [
    {
      "name": "TextTrack.activeCues",
      "link": "/en-US/docs/Web/API/TextTrack/activeCues",
      "description": "A TextTrackCueList object listing the currently active set of text track cues. Track cues are active if the current playback position of the media is between the cues\u0027 start and end times."
    },
    {
      "name": "TextTrack.cues",
      "link": "/en-US/docs/Web/API/TextTrack/cues",
      "description": "A TextTrackCueList which contains all of the track\u0027s cues."
    },
    {
      "name": "TextTrack.id",
      "link": "/en-US/docs/Web/API/TextTrack/id",
      "description": "A DOMString which identifies the track, if it has one. If it doesn\u0027t have an ID, then this value is an empty string (\"\"). If the TextTrack is associated with a \u003ctrack\u003e element, then the track\u0027s ID matches the element\u0027s ID."
    },
    {
      "name": "TextTrack.inBandMetadataTrackDispatchType",
      "link": "/en-US/docs/Web/API/TextTrack/inBandMetadataTrackDispatchType",
      "description": "Returns a DOMString which indicates the track\u0027s in-band metadata track dispatch type. needs details"
    },
    {
      "name": "TextTrack.kind",
      "link": "/en-US/docs/Web/API/TextTrack/kind",
      "description": "Returns a DOMString indicating what kind of text track the TextTrack describes. The value must be one of those in the TextTrackKind enum."
    },
    {
      "name": "TextTrack.label",
      "link": "/en-US/docs/Web/API/TextTrack/label",
      "description": "A human-readable DOMString which contains the text track\u0027s label, if one is present; otherwise, this is an empty string (\"\"), in which case a custom label may need to be generated by your code using other attributes of the track, if the track\u0027s label needs to be exposed to the user."
    },
    {
      "name": "TextTrack.language",
      "link": "/en-US/docs/Web/API/TextTrack/language",
      "description": "A DOMString which specifies the text language in which the text track\u0027s contents is written. The value must adhere to the format specified in the Tags for Identifying Languages (BCP 47) document from the IETF, just like the HTML lang attribute. For example, this can be \"en-US\" for United States English or \"pt-BR\" for Brazilian Portuguese."
    },
    {
      "name": "TextTrack.mode",
      "link": "/en-US/docs/Web/API/TextTrack/mode",
      "description": "A DOMString specifying the track\u0027s current mode. Changing this property\u0027s value changes the track\u0027s current mode to match. Permitted values are listed under Text track mode constants below.",
      "parameters": [
        {
          "name": "\"disabled\"",
          "description": "The text track is currently disabled. While the track\u0027s presence is exposed in the DOM, the user agent is otherwise ignoring it. No cues are active, no events are being fired, and the user agent won\u0027t attempt to obtain the track\u0027s cues."
        },
        {
          "name": "\"hidden\"",
          "description": "The text track is currently active but the cues aren\u0027t being displayed. If the user agent hasn\u0027t tried to obtain the track\u0027s cues yet, it will do so soon (thereby populating the track\u0027s TextTrack.cues property). The user agent is keeping a list of the active cues (in the track\u0027s activeCues property) and events are being fired at the corresponding times, even though the text isn\u0027t being displayed."
        },
        {
          "name": "\"showing\"",
          "description": "The text track is currently enabled and is visible. If the track\u0027s cues list hasn\u0027t been obtained yet, it will be soon. The activeCues list is being maintained and events are firing at the appropriate times; the track\u0027s text is also being drawn appropriately based on the styling and the track\u0027s kind."
        }
      ]
    },
    {
      "name": "TextTrack.oncuechange",
      "link": "/en-US/docs/Web/API/TextTrack/oncuechange",
      "description": "A EventHandler specifying a function to be called when a cuechange event occurs. Handling these events lets you know when cues are entered and exited. A given text cue appears when the cue is entered and disappears when the cue is exited."
    },
    {
      "name": "TextTrack.addCue()",
      "link": "/en-US/docs/Web/API/TextTrack/addCue",
      "description": "Adds a cue (specified as a TextTrackCue object to the track\u0027s list of cues."
    },
    {
      "name": "TextTrack.removeCue()",
      "link": "/en-US/docs/Web/API/TextTrack/removeCue",
      "description": "Removes a cue (specified as a TextTrackCue object from the track\u0027s list of cues."
    }
  ]
}