{
  "name": "VRPose",
  "description": "This is an experimental technology Because this technology\u0027s specification has not stabilized, check the compatibility table for usage in various browsers. Also note that the syntax and behavior of an experimental technology is subject to change in future versions of browsers as the specification changes. The VRPose interface of the WebVR API represents the state of a VR sensor at a given timestamp (which includes orientation, position, velocity, and acceleration information.)",
  "members": [
    {
      "name": "VRPose.position",
      "link": "/en-US/docs/Web/API/VRPose/position",
      "description": "Returns the position of the VRDisplay at the current VRPose.timestamp as a 3D vector"
    },
    {
      "name": "VRPose.linearVelocity",
      "link": "/en-US/docs/Web/API/VRPose/linearVelocity",
      "description": "Returns the linear velocity of the VRDisplay at the current VRPose.timestamp, in meters per second."
    },
    {
      "name": "VRPose.linearAcceleration",
      "link": "/en-US/docs/Web/API/VRPose/linearAcceleration",
      "description": "Returns the linear acceleration of the VRDisplay at the current VRPose.timestamp, in meters per second per second."
    },
    {
      "name": "VRPose.orientation",
      "link": "/en-US/docs/Web/API/VRPose/orientation",
      "description": "Returns the orientation of the sensor at the current VRPose.timestamp, as a quarternion value."
    },
    {
      "name": "VRPose.angularVelocity",
      "link": "/en-US/docs/Web/API/VRPose/angularVelocity",
      "description": "Returns the angular velocity of the VRDisplay at the current VRPose.timestamp, in radians per second."
    },
    {
      "name": "VRPose.angularAcceleration",
      "link": "/en-US/docs/Web/API/VRPose/angularAcceleration",
      "description": "Returns the angular acceleration of the VRDisplay at the current VRPose.timestamp, in meters per second per second."
    },
    {
      "name": "VRPose.timeStamp",
      "link": "/en-US/docs/Web/API/VRPose/timeStamp",
      "description": "Returns the current time stamp of the system — a monotonically increasing value useful for determining if position data has been updated, and what order updates have occured in. This version of timestamp has been removed from the spec — instead, timestamps are now returned when VRDisplay.getFrameData() is called — see VRFrameData.timestamp."
    }
  ]
}